// src/components/data/animalMomsIcons.js
export const animalMomsIcons = [
  {
    id: "1",
    from: { en: "🐶", el: "🐶" }, // μωρό σκύλου
    to: { en: "🐕", el: "🐕" }      // μαμά σκύλου
  },
  {
    id: "2",
    from: { en: "🐱", el: "🐱" }, // μωρό γάτας
    to: { en: "🐈", el: "🐈" }    // μαμά γάτας
  },
  {
    id: "3",
    from: { en: "🐰", el: "🐰" }, // μωρό λαγού
    to: { en: "🐇", el: "🐇" }    // μαμά λαγού
  },
  {
    id: "4",
    from: { en: "🐷", el: "🐷" }, // μωρό γουρουνιού
    to: { en: "🐖", el: "🐖" }    // μαμά γουρουνιού
  },
  {
    id: "5",
    from: { en: "🐮", el: "🐮" }, // μωρό αγελάδας
    to: { en: "🐄", el: "🐄" }    // μαμά αγελάδας
  },
  {
    id: "6",
    from: { en: "🐣", el: "🐣" }, // μωρό κοτόπουλου
    to: { en: "🐔", el: "🐔" }    // μαμά κότας
  },
  {
    id: "7",
    from: { en: "🦁", el: "🦁" }, // μωρό λιονταριού
    to: { en: "🦁", el: "🦁" }    // μαμά λιονταριού (μπορείς να βάλεις ίδια emoji)
  },
  {
    id: "8",
    from: { en: "🐵", el: "🐵" }, // μωρό πιθήκου
    to: { en: "🐒", el: "🐒" }    // μαμά πιθήκου
  },
  {
    id: "9",
    from: { en: "🐭", el: "🐭" }, // μωρό ποντικού
    to: { en: "🐁", el: "🐁" }    // μαμά ποντικού
  },
  {
    id: "10",
    from: { en: "🐨", el: "🐨" }, // μωρό κοάλα
    to: { en: "🐨", el: "🐨" }    // μαμά κοάλα
  }
];
